[
    {
        "intent": "summarization_privacy",
        "category": "privacy_policy",
        "train_questions": [
            "Could you provide a summary of your privacy policy?",
            "What are the key points of your privacy policy?",
            "In a few sentences, what does your privacy policy say?",
            "Can you give me an overview of your privacy policy?",
            "What is your privacy policy about?",
            "Can you give me a brief explanation of your privacy policy?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "opt_out",
        "category": "privacy_policy",
        "train_questions": [
            "How do I opt out of data sharing?",
            "Is there a way to opt out of sharing my data?",
            "What are my options for opting out of data sharing?",
            "Can you explain how to opt out of data sharing?",
            "How can I prevent my data from being shared?",
            "Can I choose not to have my data shared?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "change_message_notification_preference",
        "category": "interact",
        "platform_setting": "receive notification when someone sends you a message",
        "train_questions": [
            {
                "question": "How can I modify the setting to receive notifications when someone sends me a message?",
                "slots": ["O", "O", "O", "O", "O", "O", "O", "B-platform_setting", "I-platform_setting", "I-platform_setting", "I-platform_setting", "I-platform_setting", "I-platform_setting", "O", "O", "O", "O", "O"]
            },
            {
                "question": "Is there a way to change the notification preference for incoming messages on this platform?",
                "slots": ["O", "O", "O", "O", "O", "B-platform_setting", "I-platform_setting", "O", "O", "O", "O", "O", "O"]
            },
            {
                "question": "What steps do I need to take to update my notification settings for incoming messages?",
                "slots": ["O", "O", "O", "O", "O", "O", "O", "B-platform_setting", "I-platform_setting", "O", "O", "O"]
            }
        ],
        "responses": [
            "To change the setting for receiving notifications when someone sends you a message, please follow these steps:\n1. Go to the 'Settings' or 'Preferences' section of the platform.\n2. Look for the 'Notification Settings' or 'Message Settings' option.\n3. Within the settings, locate the option related to receiving notifications for incoming messages.\n4. Adjust the setting to your preferred choice, enabling or disabling the notification feature.\n5. Save the changes, and your notification preferences for incoming messages will be updated accordingly."
        ],
        "test_questions": [
            "How do I adjust the platform setting for receiving message notifications?",
            "Is there a way to modify the notification preference for messages on this platform?",
            "What are the steps to update my message notification settings?",
            "Where can I find the option to control message notification alerts?",
            "Can you explain how to enable or disable notifications for incoming messages?"
        ],
        "test_questions_advanced": [
            "How do I adjust the platform setting for receiving message notifications?",
            "Is there way to modify notification preference for messages on this platform?",
            "What are steps to update my message notification settings?",
            "Where can I find option to control message notification alerts?",
            "Can you explain how to enable or disable notifications for incoming messages?",
            "Where I find option to change my preference for receiving message notifications?"
        ],
        "use_gpt": false
    }
]