[
    {
        "intent": "summarization_privacy_policy",
        "category": "privacy_policy",
        "train_questions": [
            "Could you provide a summary of your privacy policy?",
            "What are the main points covered in your privacy policy?",
            "What are the key points of your privacy policy?",
            "Can you give me a short description of what your privacy policy includes?",
            "In a few sentences, what does your privacy policy say?",
            "Could you provide an overview of your privacy policy?",
            "What is your privacy policy about?",
            "Can you give me a brief explanation of your privacy policy?",
            "What is the essence of your privacy policy?",
            "What does your privacy policy entail?"
        ],
        "responses": [
            "What are the most important points of your privacy policy?"
        ],
        "test_questions": [
            "can you tell me the most important things from the privacy policy?",
            "What important information do I need to know from the privacy policy?",
            "What is the privacy policy about?",
            "Where can I find the summary of the privacy policy"
        ],
        "test_questions_advanced": [
            "can you tell me the most important things from the privacy policy?",
            "What important information do I need to know from the privacy policy?",
            "What is the privacy policy about?",
            "Where can I find the summary of the privacy policy"
        ],
        "use_gpt": true
    },
    {
        "intent": "data_sharing_opt_out",
        "category": "privacy_policy",
        "train_questions": [
            "Is there an option to opt out of sharing my data with third parties?",
            "Can I choose not to have my data shared with third parties?",
            "Do you provide a way to opt out of data sharing with third parties?",
            "Is it possible for me to prevent my data from being shared with third parties?",
            "What are the options available for opting out of data sharing with third parties?",
            "Can I control whether my data is shared with third parties or not?",
            "Do you offer an opt-out mechanism for data sharing with third parties?",
            "Is there a way for me to limit or stop the sharing of my data with third parties?",
            "Can I refuse consent for my data to be shared with third parties?",
            "What steps can I take to prevent my data from being shared with third parties?"
        ],
        "responses": [
            "Is it possible to opt out of data sharing, and if so, how do I do this?"
        ],
        "test_questions": [
            "Is there an option to opt out of having my data shared with third-party companies by iYYU?",
            "How can I prevent iYYU from sharing my personal information with third-party companies?",
            "Are there any privacy settings or preferences that allow me to control data sharing with third parties?",
            "Does iYYU provide a mechanism for users to revoke consent for data sharing with third-party companies?",
            "What steps should I take to ensure that my data is not shared with any third-party companies by iYYU?"
        ],
        "test_questions_advanced": [
            "Is there an option to opt out of having my data shared with third-party companies by iYYU?",
            "How can I prevent iYYU from sharing my personal information with third-party companies?",
            "Are there any privacy settings or preferences that allow me to control data sharing with third parties?",
            "Does iYYU provide a mechanism for users to revoke consent for data sharing with third-party companies?",
            "What steps should I take to ensure that my data is not shared with any third-party companies by iYYU?"
        ],
        "use_gpt": true
    },
    {
        "intent": "third_parties",
        "category": "privacy_policy",
        "train_questions": [
            "Do you share my personal information with third parties?",
            "Who do you share my personal information with?",
            "Are there any third parties that have access to my personal information?",
            "What third parties have access to my personal information?",
            "What happens to my personal information after it is shared with a third party?",
            "How is my personal information protected when it is shared with third parties?",
            "Can you explain the process of sharing my personal information with third parties?",
            "What measures are in place to ensure the security of my personal information when shared with third parties?",
            "Are the third parties that receive my personal information bound by confidentiality agreements?",
            "Is my consent required before sharing my personal information with third parties?"
        ],
        "responses": [
            "Do you share my personal information with third parties? If so, which parties and how is my personal information protected when it's shared with these third parties?"
        ],
        "test_questions": [
            "Which third-party companies does iYYU share user data with, and for what purposes?",
            "What types of user data does iYYU share with these third-party companies?",
            "How does iYYU ensure the security and confidentiality of user data when sharing it with third parties?",
            "How does iYYU select and evaluate the third-party companies it shares data with?",
            "Can users access or view a list of the specific third-party companies that iYYU shares data with?"
        ],
        "test_questions_advanced": [
            "Which third-party companies does iYYU share user data with, and for what purposes?",
            "What types of user data does iYYU share with these third-party companies?",
            "How does iYYU ensure the security and confidentiality of user data when sharing it with third parties?",
            "How does iYYU select and evaluate the third-party companies it shares data with?",
            "Can users access or view a list of the specific third-party companies that iYYU shares data with?"
        ],
        "use_gpt": true
    },
    {
        "intent": "data_collection",
        "category": "privacy_policy",
        "train_questions": [
            "What type of data do you collect from users?",
            "How do you collect data from your users?",
            "What methods do you use to gather user data?",
            "What kind of information do you collect from visitors?",
            "Do you collect personal information from users?",
            "What purposes do you collect data for?",
            "How long do you retain the data you collect?",
            "Are there any specific categories of data that you prioritize collecting?",
            "Do you collect data automatically or only when provided by users?",
            "Are there any third parties involved in the data collection process?"
        ],
        "responses": [
            "Provide me with information about your privacy policy, including the possibility of opting out of data sharing, the details of information shared with third parties, and your data collection practices."
        ],
        "test_questions": [
            "What kind of data did you collect from me?",
            "Do you collect data from users?",
            "What kind of user data do you save",
            "do you collect any kind of user information?",
            "What information do you collect from users?"
        ],
        "test_questions_advanced": [
            "What kind of data did you collect from me?",
            "Do you collect data from users?",
            "What kind of user data do you save",
            "do you collect any kind of user information?",
            "What information do you collect from users?"
        ],
        "use_gpt": true
    },
    {
        "intent": "personal_information",
        "category": "privacy_policy",
        "train_questions": [
            "How does the company use my personal information?",
            "What does the company do with my personal information?",
            "In what ways is my personal information used by the company?",
            "What is the company's policy on using my personal information?",
            "What kind of personal information does the company collect from me?",
            "Can I choose how my personal information is used by the company?",
            "Is my personal information used for any other purposes besides what I agreed to?",
            "How long does the company retain my personal information?",
            "Who within the company has access to my personal information?",
            "What happens to my personal information if I stop using the company's services?"
        ],
        "responses": [
            "What are the company's practices and policies regarding the use of my personal information, including the types of information collected, the options to control its usage, retention periods, access within the company, and the fate of my personal information if I discontinue using the company's services?"
        ],
        "test_questions": [
            "What happens to my personal information?",
            "Does iYYU save all my personal information?",
            "Do I have control of how iYYU uses my personal data?"
        ],
        "test_questions_advanced": [
            "What happens to my personal information?",
            "Does iYYU save all my personal information?",
            "Do I have control of how iYYU uses my personal data?"
        ],
        "use_gpt": true
    },
    {
        "intent": "data_storage",
        "category": "privacy_policy",
        "train_questions": [
            "How is my personal information stored and secured?",
            "What measures does the company take to protect my personal information?",
            "What kind of security protocols are in place for my personal information?",
            "Who has access to my personal information?",
            "How is my personal information encrypted?",
            "Where is my personal information stored?",
            "What happens to my personal information if there is a security breach?",
            "How often is my personal information backed up?",
            "How long is my personal information retained for?",
            "Can I request that my personal information be deleted?"
        ],
        "responses": [
            "What are the company's practices and protocols concerning the storage, security, access, encryption, backup frequency, retention period, and deletion of my personal information? Additionally, what measures are in place to protect my personal information in the event of a security breach?"
        ],
        "test_questions": [
            "Is my personal data stored safely?",
            "Is my personal data hidden?",
            "Where is my personal data stored?",
            "Can other people find my personal data?",
            "Can I delete my personal information?",
            "is my personal information encrypted?",
            "is my personal information savely stored?"
        ],
        "test_questions_advanced": [
            "Is my personal data stored safely?",
            "Is my personal data hidden?",
            "Where is my personal data stored?",
            "Can other people find my personal data?",
            "Can I delete my personal information?",
            "is my personal information encrypted?",
            "is my personal information savely stored?"
        ],
        "use_gpt": true
    },
    {
        "intent": "personal_information_rights",
        "category": "privacy_policy",
        "train_questions": [
            "What are my rights regarding my personal information?",
            "Can I access my personal information?",
            "Can I update or correct my personal information?",
            "Can I delete my personal information?",
            "What happens to my personal information if I delete my account?",
            "Can I request a copy of my personal information?",
            "How long does it take for the company to respond to my personal information requests?",
            "What information does the company need from me to process my personal information requests?",
            "Can I object to the company processing my personal information?",
            "What can I do if the company violates my personal information rights?"
        ],
        "responses": [
            "What are my rights regarding my personal information, including access, updates, deletion, consequences of account deletion, requesting a copy, response times for information requests, required information for processing requests, objection to processing, and available recourse in case of personal information rights violations?"
        ],
        "test_questions": [
            "Is it possible for me to access my personal information?",
            "How do I change my personal information",
            "Do I have any control over my personal information?",
            "Can I change my personal information?",
            "What can I do in cases of personal information violation?"
        ],
        "test_questions_advanced": [
            "Is it possible for me to access my personal information?",
            "How do I change my personal information",
            "Do I have any control over my personal information?",
            "Can I change my personal information?",
            "What can I do in cases of personal information violation?"
        ],
        "use_gpt": true
    },
    {
        "intent": "access_personal_data",
        "category": "privacy_policy",
        "train_questions": [
            "How can I request access to my personal information?",
            "What is the process for requesting access to my personal information?",
            "How do I go about requesting access to my personal information?",
            "How can I access my personal information?",
            "Can you tell me how to request access to my personal information?",
            "What steps should I take to request access to my personal data?",
            "How do I obtain access to my personal information?",
            "What is the procedure to request access to my personal information?",
            "How do I download my personal information?",
            "What do I need to do to gain access to my personal information?"
        ],
        "responses": [
            "What is the procedure for requesting access to my personal information, and how can I go about obtaining access? Can you guide me through the steps and provide instructions on how to request and access my personal data?"
        ],
        "test_questions": [
            "How can I access my personal information?",
            "How can I access my personal data",
            "How can I see all my personal data",
            "Give me a list of my personal data"
        ],
        "test_questions_advanced": [
            "How can I access my personal information?",
            "How can I access my personal data",
            "How can I see all my personal data",
            "Give me a list of my personal data"
        ],
        "use_gpt": true
    },
    {
        "intent": "update_personal_data",
        "category": "privacy_policy",
        "train_questions": [
            "How can I update my personal information?",
            "What is the process to update my personal information?",
            "How do I go about updating my personal information?",
            "Can you tell me how to update my information?",
            "What steps should I take to update my personal data?",
            "How do I make changes to my personal information?",
            "What is the procedure to update my personal information?",
            "Can you guide me on how to update my personal information?",
            "What do I need to do to modify my personal information?",
            "How can I make changes to my personal information?"
        ],
        "responses": [
            "What is the process for updating my personal information, and how can I go about making changes? Can you guide me through the steps and provide instructions on how to update and modify my personal data?"
        ],
        "test_questions": [
            "How can I update my personal data",
            "How can I change my personal data",
            "How can I edit my personal data",
            "How can I update my personal data"
        ],
        "test_questions_advanced": [
            "How can I update my personal data",
            "How can I change my personal data",
            "How can I edit my personal data",
            "How can I update my personal data"
        ],
        "use_gpt": true
    },
    {
        "intent": "delete_personal_information",
        "category": "privacy_policy",
        "train_questions": [
            "How can I delete my personal information?",
            "What is the process to delete my personal information?",
            "How do I go about deleting my information?",
            "Can you tell me how to delete my personal information?",
            "What steps should I take to delete my personal data?",
            "How do I remove my personal information?",
            "What is the procedure to delete my personal information?",
            "Can you guide me on how to delete my personal information?",
            "What do I need to do to erase my personal data?",
            "How can I request the removal of my information?"
        ],
        "responses": [
            "What is the process for deleting my personal information, and how can I go about requesting its removal? Can you guide me through the steps and provide instructions on how to delete and erase my personal data?"
        ],
        "test_questions": [
            "How do I delete my personal information",
            "Can I delete all my personal data",
            "Can I request data deletion?",
            "Can my data get deleted?",
            "Is it possible to delete my data?"
        ],
        "test_questions_advanced": [
            "How do I delete my personal information",
            "Can I delete all my personal data",
            "Can I request data deletion?",
            "Can my data get deleted?",
            "Is it possible to delete my data?"
        ],
        "use_gpt": true
    },
    {
        "intent": "cookie_policy",
        "category": "privacy_policy",
        "train_questions": [
            "What is the policy regarding cookies at this company?",
            "Can you explain the company's policy on cookies?",
            "What are the company's guidelines for cookies?",
            "How does the company handle cookies?",
            "Can you tell me about the company's cookie policies?",
            "What is the official policy on cookies for the company?",
            "What are the rules around cookies for this company?",
            "What are the regulations for cookies at this company?",
            "What are the company's protocols for handling cookies?",
            "Can you provide information on the company's cookie policies?"
        ],
        "responses": [
            "What is the company's policy regarding cookies, and how does the company handle them? Can you provide information on the company's guidelines, rules, regulations, and protocols for handling cookies?"
        ],
        "test_questions": [
            "How does iYYU operate with cookies",
            "What are the cookie policies?",
            "Can you tell me about the cookies?",
            "How do you handle cookies?",
            "What are the cookie rules?"
        ],
        "test_questions_advanced": [
            "How does iYYU operate with cookies",
            "What are the cookie policies?",
            "Can you tell me about the cookies?",
            "How do you handle cookies?",
            "What are the cookie rules?"
        ],
        "use_gpt": true
    },
    {
        "intent": "privacy_regulations",
        "category": "privacy_policy",
        "train_questions": [
            "Is the company in compliance with privacy regulations?",
            "Does the company follow privacy regulations?",
            "What is the company's stance on privacy regulations?",
            "Are the company's privacy policies in line with regulations?",
            "How does the company ensure compliance with privacy regulations?",
            "Are there any privacy's by the company?",
            "What measures has the company taken to comply with privacy regulations?",
            "Can you tell me if the company adheres to privacy regulations?",
            "What are the company's policies on privacy compliance?",
            "Has the company faced any penalties for not complying with privacy regulations?"
        ],
        "responses": [
            "Is the company in compliance with privacy regulations? How does the company ensure compliance, and what measures has it taken to adhere to privacy regulations? Has the company faced any penalties or violations in relation to privacy regulations? Please provide information on the company's stance, policies, and actions regarding privacy compliance."
        ],
        "test_questions": [
            "What privacy regulations does iYYU comply with?"
            "How does iYYU ensure compliance with privacy regulations in its data handling practices?",
            "Can you provide an overview of the specific privacy regulations that govern iYYU's operations?",
            "Are there any certifications or industry standards that iYYU adheres to regarding privacy and data protection?",
            "Does iYYU have a designated privacy officer or team responsible for overseeing and enforcing privacy regulations?",
            "How does iYYU handle cross-border data transfers in compliance with privacy regulations?",
            "What steps does iYYU take to stay up to date with evolving privacy regulations and adapt its practices accordingly?"
        ],
        "test_questions_advanced": [
            "What privacy regulations does iYYU comply with?"
            "How does iYYU ensure compliance with privacy regulations in its data handling practices?",
            "Can you provide an overview of the specific privacy regulations that govern iYYU's operations?",
            "Are there any certifications or industry standards that iYYU adheres to regarding privacy and data protection?",
            "Does iYYU have a designated privacy officer or team responsible for overseeing and enforcing privacy regulations?",
            "How does iYYU handle cross-border data transfers in compliance with privacy regulations?",
            "What steps does iYYU take to stay up to date with evolving privacy regulations and adapt its practices accordingly?"
        ],
        "use_gpt": true
    },
    {
        "intent": "privacy_policy_updates",
        "category": "privacy_policy",
        "train_questions": [
            "How often is the privacy policy updated?",
            "What is the frequency of updates to the privacy policy?",
            "How frequently is the privacy policy updated?",
            "Is there a regular schedule for updating the privacy policy?",
            "What is the policy on updating the privacy policy?",
            "How often are changes made to the privacy policy?",
            "Are there any rules around updating the privacy policy?",
            "What is the timeline for updating the privacy policy?",
            "Can you provide information on the update frequency for the privacy policy?",
            "What are the guidelines for updating the privacy policy?"
        ],
        "responses": [
            "What is the company's policy or schedule for updating the privacy policy? How often is the privacy policy reviewed and updated? Are there specific guidelines or rules in place for updating the privacy policy? Please provide information on the frequency and timeline for updates to the privacy policy."
        ],
        "test_questions": [
              "Is there a specific schedule for updating the privacy policy?",
              "How frequently does the privacy policy undergo updates?",
              "Are there any guidelines or rules in place for updating the privacy policy?",
              "Can you provide details on the timeline for privacy policy updates?",
              "What is the typical frequency of changes to the privacy policy?",
              "Do you have a set policy on how often the privacy policy is updated?"
        ],
        "test_questions_advanced": [
              "Is there a specific schedule for updating the privacy policy?",
              "How frequently does the privacy policy undergo updates?",
              "Are there any guidelines or rules in place for updating the privacy policy?",
              "Can you provide details on the timeline for privacy policy updates?",
              "What is the typical frequency of changes to the privacy policy?",
              "Do you have a set policy on how often the privacy policy is updated?"
        ],
        "use_gpt": true
    },
    {
        "intent": "minimum_age",
        "category": "privacy_policy",
        "train_questions": [
            "What is the minimum age requirement for using the company's services?",
            "What is the age limit for using the company's services?",
            "Is there a minimum age requirement to use the company's services?",
            "What is the company's policy on age requirements?",
            "How old do you have to be to use the company's services?",
            "Are there any age restrictions for using the company's services?",
            "What is the company's policy on age restrictions?",
            "Is there an age limit for accessing the company's services?",
            "What is the minimum age to use the company's services?",
            "What are the rules regarding the age limit for using the company's services?"
        ],
        "responses": [
            "What is the company's policy on the minimum age requirement for using its services? Are there any age restrictions or limits in place? Can you provide information on the age requirements, rules, and policies regarding the usage of the company's services?"
        ],
        "test_questions": [
              "Is there a specific minimum age requirement to access the company's services?",
              "What is the age limit set by the company for using its services?",
              "Are there any age restrictions imposed on users accessing the company's services?",
              "What is the company's policy regarding the minimum age to use its services?",
              "Is there an age limit that users must meet to utilize the company's services?",
              "Can you provide details on the rules pertaining to the age limit for using the company's services?"
        ],
        "test_questions_advanced": [
              "Is there a specific minimum age requirement to access the company's services?",
              "What is the age limit set by the company for using its services?",
              "Are there any age restrictions imposed on users accessing the company's services?",
              "What is the company's policy regarding the minimum age to use its services?",
              "Is there an age limit that users must meet to utilize the company's services?",
              "Can you provide details on the rules pertaining to the age limit for using the company's services?"
        ],
        "use_gpt": true
    },
    {
        "intent": "data_breaches",
        "category": "privacy_policy",
        "train_questions": [
            "How do you handle data breaches?",
            "What is the company's protocol for handling data breaches?",
            "In the event of a data breach, what steps does iYYU take?",
            "Can you explain the your approach to dealing with data breaches?",
            "How does iYYU respond to data breaches?",
            "What measures does the company have in place to handle data breaches?",
            "If there is a data breach, what actions does iYYU take?",
            "What policies do you have in place for managing data breaches?",
            "What is the company's plan of action in the event of a data breach?",
            "Can you tell me how the company manages data breaches?"
        ],
        "responses": [
            "What is the company's protocol or approach for handling data breaches? How does the company respond to data breaches, and what steps does it take in the event of a data breach? Can you explain the company's measures, policies, and plan of action for managing data breaches?"
        ],
        "test_questions": [
              "What is the company's response protocol in the event of a data breach?",
              "Can you explain the steps iYYU takes to handle data breaches?",
              "What specific measures does iYYU have in place to mitigate and manage data breaches?",
              "In the event of a data breach, what actions does iYYU typically take to address the situation?",
              "How does iYYU ensure the security and protection of user data during a data breach?",
              "What policies and procedures does iYYU follow to manage and respond to data breaches?"
        ],
        "test_questions_advanced": [
              "What is the company's response protocol in the event of a data breach?",
              "Can you explain the steps iYYU takes to handle data breaches?",
              "What specific measures does iYYU have in place to mitigate and manage data breaches?",
              "In the event of a data breach, what actions does iYYU typically take to address the situation?",
              "How does iYYU ensure the security and protection of user data during a data breach?",
              "What policies and procedures does iYYU follow to manage and respond to data breaches?"
        ],
        "use_gpt": true
    },
    {
        "intent": "opt_out_targeted_advertising",
        "category": "privacy_policy",
        "train_questions": [
            "How can I opt out of targeted advertising?",
            "What are the steps to stop receiving targeted ads?",
            "Is there a way to disable personalized ads?",
            "Can you explain how to opt out of targeted advertising?",
            "Are there any tools to block targeted ads?",
            "What options do I have to avoid targeted advertising?",
            "How do I prevent targeted ads from appearing?",
            "What are the ways to unsubscribe from personalized ads?",
            "Could you guide me on opting out of targeted advertising?",
            "Is it possible to stop getting targeted ads?"
        ],
        "responses": [
            "Can you provide information on how to opt out of targeted advertising and the available tools or steps to prevent personalized ads?"
        ],
        "test_questions": [
              "Are there specific steps or instructions to opt out of targeted advertising?",
              "Can you provide details on the process to disable personalized ads?",
              "What tools or methods are available to block or avoid targeted advertising?",
              "How can I prevent targeted ads from being displayed to me?",
              "Is there a guide or tutorial on unsubscribing from personalized ads?",
              "What options or settings can I adjust to stop receiving targeted ads?"
        ],
        "test_questions_advanced": [
              "Are there specific steps or instructions to opt out of targeted advertising?",
              "Can you provide details on the process to disable personalized ads?",
              "What tools or methods are available to block or avoid targeted advertising?",
              "How can I prevent targeted ads from being displayed to me?",
              "Is there a guide or tutorial on unsubscribing from personalized ads?",
              "What options or settings can I adjust to stop receiving targeted ads?"
        ],
        "use_gpt": true
    },
    {
        "intent": "contact_privacy_concerns",
        "category": "privacy_policy",
        "train_questions": [
            "How can I contact the company for privacy-related concerns?",
            "What are the ways to contact the company regarding privacy issues?",
            "Is there a specific contact point for privacy concerns within the company?",
            "How do I get in touch with the company if I have privacy-related questions?",
            "Can you tell me how to contact the company for privacy concerns?",
            "What is the process for contacting the company about privacy matters?",
            "Who should I contact if I have privacy concerns with the company's services?",
            "How can I report a privacy issue to the company?",
            "Can you provide me with the contact information for the company's privacy department?",
            "What are the available channels to raise privacy concerns with the company?"
        ],
        "responses": [
            "What are the various ways to get in touch with the company regarding privacy issues, including specific contact points and channels to report privacy concerns?"
        ],
        "test_questions": [
            "What are the contact details to reach out to the company regarding privacy-related concerns?",
            "Can you provide information on the specific contact point within the company for privacy issues?",
            "How can I report a privacy concern to the company's dedicated privacy department?",
            "What are the available channels of communication to raise privacy concerns with the company?",
            "Is there a designated process or procedure for contacting the company about privacy matters?",
            "Who should I reach out to if I have privacy concerns with the company's services?"
        ],
        "test_questions_advanced": [
            "What are the contact details to reach out to the company regarding privacy-related concerns?",
            "Can you provide information on the specific contact point within the company for privacy issues?",
            "How can I report a privacy concern to the company's dedicated privacy department?",
            "What are the available channels of communication to raise privacy concerns with the company?",
            "Is there a designated process or procedure for contacting the company about privacy matters?",
            "Who should I reach out to if I have privacy concerns with the company's services?"
        ],
        "use_gpt": true
    },
    {
        "intent": "disagree_privacy_consequences",
        "category": "privacy_policy",
        "train_questions": [
            "What are the consequences of not agreeing to the privacy policy?",
            "What happens if I don't agree to the privacy policy?",
            "Could you explain the consequences of declining the privacy policy?",
            "What are the implications of not consenting to the privacy policy?",
            "Is it mandatory to accept the privacy policy? What are the consequences if I don't?",
            "If I don't agree to the privacy policy, will there be any consequences?",
            "Are there any penalties for not accepting the privacy policy?",
            "Can you tell me what happens if I choose not to accept the privacy policy?",
            "What are the risks of not accepting the privacy policy?",
            "Is there anything I should know about the consequences of declining the privacy policy?"
        ],
        "responses": [
            "What are the potential implications and consequences of declining or not agreeing to the privacy policy?"
        ],
        "test_questions": [
            "What are the potential implications of not agreeing to the privacy policy?",
            "Can you explain the possible consequences of declining the privacy policy?",
            "Is accepting the privacy policy mandatory, and if not, what are the potential risks?",
            "Are there any penalties or adverse effects for not accepting the privacy policy?",
            "What happens if I choose not to accept the privacy policy? Are there any specific outcomes?",
            "Could you provide more information about the risks or drawbacks of not agreeing to the privacy policy?"
        ],
        "test_questions_advanced": [
            "What are the potential implications of not agreeing to the privacy policy?",
            "Can you explain the possible consequences of declining the privacy policy?",
            "Is accepting the privacy policy mandatory, and if not, what are the potential risks?",
            "Are there any penalties or adverse effects for not accepting the privacy policy?",
            "What happens if I choose not to accept the privacy policy? Are there any specific outcomes?",
            "Could you provide more information about the risks or drawbacks of not agreeing to the privacy policy?"
        ],
        "use_gpt": true
    },
    {
        "intent": "selling_personal_data",
        "category": "privacy_policy",
        "train_questions": [
            "Does the company sell my personal information?",
            "Does the company share or sell my personal information?",
            "Is my personal information sold by the company?",
            "What happens to my personal information, is it sold by the company?",
            "Can my personal information be sold by the company?",
            "Is my personal information safe from being sold by the company?",
            "Is the company permitted to sell my personal information?",
            "Does the company have a policy on selling personal information?",
            "How does the company handle the selling of personal information?",
            "Is it possible for my personal information to be sold by the company without my consent?"
        ],
        "responses": [
            "What is the company's policy or stance on the sharing or selling of personal information, and how does it ensure the safety and consent of users' data?"
        ],
        "test_questions": [
            "Does the company have a policy on sharing or selling personal information?",
            "What measures does the company have in place to protect personal information from being sold?",
            "Is my personal information safe from being shared or sold by the company?",
            "Can the company sell my personal information without obtaining my consent?",
            "What are the guidelines or restrictions on the company's handling of personal information in terms of selling it?",
            "Does the company adhere to any specific regulations or laws regarding the sale of personal information?"
        ],
        "test_questions_advanced": [
            "Does the company have a policy on sharing or selling personal information?",
            "What measures does the company have in place to protect personal information from being sold?",
            "Is my personal information safe from being shared or sold by the company?",
            "Can the company sell my personal information without obtaining my consent?",
            "What are the guidelines or restrictions on the company's handling of personal information in terms of selling it?",
            "Does the company adhere to any specific regulations or laws regarding the sale of personal information?"
        ],
        "use_gpt": true
    },
    {
        "intent": "personal_data_account_deletion",
        "category": "privacy_policy",
        "train_questions": [
            "What happens to my personal information when I terminate my account?",
            "What occurs with my personal information after I close my account?",
            "Does my personal information get deleted when I terminate my account?",
            "How is my personal information handled once I cancel my account?",
            "Will my personal information be retained after I terminate my account?",
            "What is done with my personal information when I end my account?",
            "Is my personal information kept after I cancel my account?",
            "What happens to my personal data when I terminate my account?",
            "How is my personal data managed when I close my account?",
            "Will my personal data be erased after I end my account?"
        ],
        "responses": [
            "What is the iYYU's policy or process regarding the handling of personal information when a user terminates their account, including data retention and deletion?"
        ],
        "test_questions": [
            "What is the company's policy on the retention of personal information after an account termination?",
            "Is my personal information deleted or retained when I terminate my account?",
            "Can you provide details on how the company handles personal information after an account closure?",
            "What specific actions are taken with my personal information once I cancel my account?",
            "Will my personal data be permanently erased or stored after I end my account?",
            "How long does the company retain personal information after an account termination?"
        ],
        "test_questions_advanced": [
            "What is the company's policy on the retention of personal information after an account termination?",
            "Is my personal information deleted or retained when I terminate my account?",
            "Can you provide details on how the company handles personal information after an account closure?",
            "What specific actions are taken with my personal information once I cancel my account?",
            "Will my personal data be permanently erased or stored after I end my account?",
            "How long does the company retain personal information after an account termination?"
        ],
        "use_gpt": true
    },
    {
        "intent": "legal_statement_information",
        "category": "legal_statement",
        "train_questions": [
            "What are the terms of service for this platform?",
            "Where can I find the terms of service for this platform?",
            "What is covered in the platform's terms of service?",
            "Can you explain the terms of service for this platform?",
            "What are the rules I need to follow according to the platform's terms of service?",
            "Are there any restrictions outlined in the platform's terms of service?",
            "What are my rights under the platform's terms of service?",
            "Is it mandatory to agree to the terms of service before using the platform?",
            "What are the consequences of violating the platform's terms of service?",
            "What happens if I don't understand something in the platform's terms of service?"
        ],
        "responses": [
            "What are the contents, location, rules, restrictions, user rights, agreement requirement, consequences of violations, and support available for understanding the platform's terms of service?"
        ],
        "test_questions": [
            "Where can I access and read the platform's terms of service?",
            "What are the key provisions or sections covered in the platform's terms of service?",
            "Can you provide an overview or summary of the platform's terms of service?",
            "Are there any specific obligations or responsibilities outlined in the platform's terms of service?",
            "What rights do users have under the platform's terms of service?",
            "Is it mandatory to agree to the terms of service prior to using the platform?",
            "What are the potential consequences or penalties for violating the platform's terms of service?",
            "Is there any support or assistance available if I have difficulty understanding the platform's terms of service?"
        ],
        "test_questions_advanced": [
            "Where can I access and read the platform's terms of service?",
            "What are the key provisions or sections covered in the platform's terms of service?",
            "Can you provide an overview or summary of the platform's terms of service?",
            "Are there any specific obligations or responsibilities outlined in the platform's terms of service?",
            "What rights do users have under the platform's terms of service?",
            "Is it mandatory to agree to the terms of service prior to using the platform?",
            "What are the potential consequences or penalties for violating the platform's terms of service?",
            "Is there any support or assistance available if I have difficulty understanding the platform's terms of service?"
        ],
        "use_gpt": true
    },
    {
        "intent": "summarization_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "Can you summarize the liability section of the terms of service?",
            "Could you provide a brief overview of the liability section in the terms of service?",
            "How would you summarize the liability section of the terms of service?",
            "Can you give me a summary of the terms of service's liability section?",
            "What is the liability section of the terms of service and can you summarize it?",
            "Would you mind summarizing the liability section of the terms of service for me?",
            "Can you provide a quick summary of the liability section in the terms of service?",
            "Could you explain the liability section of the terms of service in a nutshell?",
            "What does the liability section of the terms of service say, and could you summarize it for me?",
            "I'm curious about the liability section of the terms of service. Would you be able to provide a summary?"
        ],
        "responses": [
            "Can you provide a concise summary of the liability section in the terms of service, outlining the key points related to user responsibilities, limitations, and the platform's liability?"
        ],
        "test_questions": [
            "What are the key points or provisions covered in the liability section of the terms of service?",
            "Can you provide an overview or summary of the company's liability in the terms of service?",
            "What is the scope of liability outlined in the terms of service and how can it be summarized?",
            "Could you give me a brief summary of the liability section in the terms of service?",
            "Can you explain the potential liabilities or limitations described in the terms of service's liability section?"
        ],
        "test_questions_advanced": [
            "What are the key points or provisions covered in the liability section of the terms of service?",
            "Can you provide an overview or summary of the company's liability in the terms of service?",
            "What is the scope of liability outlined in the terms of service and how can it be summarized?",
            "Could you give me a brief summary of the liability section in the terms of service?",
            "Can you explain the potential liabilities or limitations described in the terms of service's liability section?"
        ],
        "use_gpt": true
    },
    {
        "intent": "terms_of_service_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "What are the terms of service for this platform?",
            "Where can I find the terms of service for this platform?",
            "Are there any specific terms I should be aware of for using this platform?",
            "How can I access the terms of service for this platform?",
            "Can you explain the terms of service for this platform?",
            "What rules do I need to follow when using this platform?",
            "What are the guidelines for using this platform?",
            "Do the terms of service for this platform include a refund policy?",
            "What are my rights and responsibilities under the terms of service for this platform?",
            "Are there any restrictions on using this platform according to the terms of service?"
        ],
        "responses": [
            "What are the terms of service for this platform, where can they be accessed, are there any specific terms or guidelines users should be aware of, and what are the rights, responsibilities, rules, restrictions, and refund policy mentioned in the terms of service?"
        ],
        "test_questions": [
            "Where can I locate and review the terms of service for this platform?",
            "Are there any specific provisions or sections in the terms of service that users should pay attention to?",
            "How can I access and familiarize myself with the terms of service for this platform?",
            "Could you provide an overview or summary of the terms of service for this platform?",
            "Does the terms of service for this platform include a refund policy or any provisions related to refunds?",
            "What rights and responsibilities do users have under the terms of service for this platform?",
            "Are there any specific restrictions or limitations on using this platform outlined in the terms of service?"
        ],
        "test_questions_advanced": [
            "Where can I locate and review the terms of service for this platform?",
            "Are there any specific provisions or sections in the terms of service that users should pay attention to?",
            "How can I access and familiarize myself with the terms of service for this platform?",
            "Could you provide an overview or summary of the terms of service for this platform?",
            "Does the terms of service for this platform include a refund policy or any provisions related to refunds?",
            "What rights and responsibilities do users have under the terms of service for this platform?",
            "Are there any specific restrictions or limitations on using this platform outlined in the terms of service?"
           
        ],
        "use_gpt": true
    },
    {
        "intent": "governing_law_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "What is the governing law for the legal agreement?",
            "Which law governs the legal agreement?",
            "Under which law is the legal agreement governed?",
            "What law is applicable to the legal agreement?",
            "What is the applicable law for the legal agreement?",
            "What law applies to the legal agreement?",
            "What is the legal agreement governed by?",
            "What is the applicable governing law for the legal agreement?",
            "What law regulates the legal agreement?",
            "What law controls the legal agreement?"
        ],
        "responses": [
            "Which law governs or is applicable to the legal agreement?"
        ],
        "test_questions": [
            "Which jurisdiction's law is specified as the governing law in the legal agreement?",
            "Can you provide information on the specific governing law mentioned in the legal agreement?",
            "Under the legal agreement, which legal system or jurisdiction's laws apply?",
            "What factors were considered in determining the governing law for the legal agreement?",
            "Are there any specific provisions or clauses in the legal agreement related to the governing law?",
            "Can you clarify how the choice of governing law in the legal agreement was determined?"
        ],
        "test_questions_advanced": [
            "Which jurisdiction's law is specified as the governing law in the legal agreement?",
            "Can you provide information on the specific governing law mentioned in the legal agreement?",
            "Under the legal agreement, which legal system or jurisdiction's laws apply?",
            "What factors were considered in determining the governing law for the legal agreement?",
            "Are there any specific provisions or clauses in the legal agreement related to the governing law?",
            "Can you clarify how the choice of governing law in the legal agreement was determined?"
           
        ],
        "use_gpt": true
    },
    {
        "intent": "liability_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "Can you summarize the liability section of the legal agreement?",
            "Can you provide a brief summary of the liability section in the legal agreement?",
            "What is the liability section of the legal agreement about?",
            "Could you summarize the legal agreement's section on liability?",
            "Can you explain the liability section of the legal agreement in simple terms?",
            "What does the liability section of the legal agreement cover?",
            "What are the key points of the liability section in the legal agreement?",
            "Can you give me an overview of the legal agreement's liability section?",
            "What is included in the liability section of the legal agreement?",
            "Can you briefly describe the liability section of the legal agreement?"
        ],
        "responses": [
            "Can you provide a concise summary of the liability section in the legal agreement, outlining the key points related to responsibilities, limitations, and potential consequences?"
        ],
        "test_questions": [
            "What are the main provisions or clauses covered in the liability section of the legal agreement?",
            "Can you provide a summary of the company's liability as outlined in the legal agreement?",
            "In simple terms, what does the liability section of the legal agreement entail?",
            "Could you highlight the key responsibilities or obligations mentioned in the liability section of the legal                      agreement?",
            "What are the potential liabilities or limitations specified in the liability section of the legal agreement?",
            "Can you explain how the liability section of the legal agreement impacts the parties involved?"
        ],
        "test_questions_advanced": [
            "What are the main provisions or clauses covered in the liability section of the legal agreement?",
            "Can you provide a summary of the company's liability as outlined in the legal agreement?",
            "In simple terms, what does the liability section of the legal agreement entail?",
            "Could you highlight the key responsibilities or obligations mentioned in the liability section of the legal                      agreement?",
            "What are the potential liabilities or limitations specified in the liability section of the legal agreement?",
            "Can you explain how the liability section of the legal agreement impacts the parties involved?"
        ],
        "use_gpt": true
    },
    {
        "intent": "dispute_resolution_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "What is the dispute resolution process outlined in the legal agreement?",
            "Can you explain the dispute resolution process described in the legal agreement?",
            "What is the procedure for resolving disputes outlined in the legal agreement?",
            "How does the legal agreement specify disputes should be resolved?",
            "What are the steps outlined in the legal agreement for dispute resolution?",
            "What mechanisms are in place to resolve disputes according to the legal agreement?",
            "What is the protocol for resolving disputes laid out in the legal agreement?",
            "What does the legal agreement say about the process for settling disputes?",
            "How are disputes addressed in the legal agreement?",
            "Can you give me a summary of the dispute resolution process outlined in the legal agreement?"
        ],
        "responses": [
            "What is the procedure or process outlined in the legal agreement for resolving disputes, and what mechanisms or steps are in place to address conflicts or disagreements?"
        ],
        "test_questions": [
            "Can you provide an overview of the dispute resolution process described in the legal agreement?",
            "What are the available methods or options for resolving disputes according to the legal agreement?",
            "Are there any specific timelines or deadlines mentioned for the dispute resolution process in the legal agreement?",
            "How does the legal agreement address the selection of arbitrators or mediators for dispute resolution?",
            "What factors are considered in determining the jurisdiction or venue for dispute resolution as per the legal                      agreement?",
            "Can you explain any provisions related to alternative dispute resolution methods mentioned in the legal agreement?"
        ],
        "test_questions_advanced": [
            "Can you provide an overview of the dispute resolution process described in the legal agreement?",
            "What are the available methods or options for resolving disputes according to the legal agreement?",
            "Are there any specific timelines or deadlines mentioned for the dispute resolution process in the legal agreement?",
            "How does the legal agreement address the selection of arbitrators or mediators for dispute resolution?",
            "What factors are considered in determining the jurisdiction or venue for dispute resolution as per the legal                      agreement?",
            "Can you explain any provisions related to alternative dispute resolution methods mentioned in the legal agreement?"
        ],
        "use_gpt": true
    },
    {
        "intent": "arbitration_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "Can I opt-out of arbitration?",
            "Is there an option to opt-out of arbitration?",
            "Can I choose not to participate in arbitration?",
            "How can I avoid arbitration?",
            "Am I required to participate in arbitration or can I opt-out?",
            "What are my options regarding arbitration?",
            "Is there a way to decline arbitration?",
            "Can I refuse to go through arbitration?",
            "Is it mandatory to go through arbitration or can I opt-out?",
            "What are the alternatives to arbitration and can I opt-out of it?"
        ],
        "responses": [
            "Is there an option to opt-out of arbitration, and what are the alternatives or choices available for individuals who prefer not to participate in the arbitration process?"
        ],
        "test_questions": [
            "What is the process for opting out of arbitration as outlined in the legal agreement?",
            "Can you explain the steps or requirements for opting out of arbitration?",
            "Are there any specific deadlines or procedures for opting out of arbitration?",
            "What are the consequences or implications of opting out of arbitration?",
            "Can you provide information on the alternative dispute resolution methods available if I choose to opt-out of                    arbitration?",
            "Is there any additional information I should know about opting out of arbitration in the legal agreement?"
        ],
        "test_questions_advanced": [
            "What is the process for opting out of arbitration as outlined in the legal agreement?",
            "Can you explain the steps or requirements for opting out of arbitration?",
            "Are there any specific deadlines or procedures for opting out of arbitration?",
            "What are the consequences or implications of opting out of arbitration?",
            "Can you provide information on the alternative dispute resolution methods available if I choose to opt-out of                    arbitration?",
            "Is there any additional information I should know about opting out of arbitration in the legal agreement?"
        ],
        "use_gpt": true
    },
    {
        "intent": "small_claims_court_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "How are disputes handled in small claims court?",
            "What is the process for small claims court?",
            "What is the procedure for small claims court?",
            "Can you explain how small claims court works?",
            "What happens in small claims court?",
            "How does small claims court work?",
            "How do I file a claim in small claims court?",
            "What are the rules for small claims court?",
            "What is the jurisdiction of small claims court?",
            "What are the limitations of small claims court?"
        ],
        "responses": [
            "What is the process, procedure, jurisdiction, rules, and limitations of small claims court, and how does it work when resolving disputes?"
        ],
        "test_questions": [
            "What is the monetary limit for filing a claim in small claims court?",
            "Can you explain the difference between small claims court and regular civil court?",
            "Are there any restrictions on the types of cases that can be brought to small claims court?",
            "How long does it typically take for a case to be resolved in small claims court?",
            "What is the role of a judge in small claims court?",
            "Can you provide examples of common disputes that are often resolved in small claims court?"
        ],
        "test_questions_advanced": [
            "What is the monetary limit for filing a claim in small claims court?",
            "Can you explain the difference between small claims court and regular civil court?",
            "Are there any restrictions on the types of cases that can be brought to small claims court?",
            "How long does it typically take for a case to be resolved in small claims court?",
            "What is the role of a judge in small claims court?",
            "Can you provide examples of common disputes that are often resolved in small claims court?"
        ],
        "use_gpt": true
    },
    {
        "intent": "user_obligations_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "What are my obligations as a user under the legal agreement?",
            "What am I required to do as a user according to the legal agreement?",
            "What are the user responsibilities outlined in the legal agreement?",
            "What are the terms of use for users outlined in the legal agreement?",
            "What are my duties and responsibilities under the legal agreement?",
            "What are the obligations of users in the legal agreement?",
            "What actions are prohibited under the legal agreement?",
            "What are the rules and regulations that I must follow as a user?",
            "What are the limitations on user behavior in the legal agreement?",
            "What are the expectations for users according to the legal agreement?"
          ],
        "responses": [
            "What are the obligations, responsibilities, duties, prohibited actions, rules, regulations, guidelines, limitations, and expectations outlined in the legal agreement for users?"
        ],
        "test_questions": [
            "Are there any restrictions on sharing confidential information as a user?",
            "Can you provide examples of actions that are prohibited under the legal agreement?",
            "What are the consequences for violating the user obligations outlined in the legal agreement?",
            "Is there a code of conduct that users must adhere to according to the legal agreement?",
            "Are there any limitations on user-generated content in the legal agreement?",
            "What measures are in place to enforce user responsibilities in the legal agreement?"
        ],
        "test_questions_advanced": [
            "Are there any restrictions on sharing confidential information as a user?",
            "Can you provide examples of actions that are prohibited under the legal agreement?",
            "What are the consequences for violating the user obligations outlined in the legal agreement?",
            "Is there a code of conduct that users must adhere to according to the legal agreement?",
            "Are there any limitations on user-generated content in the legal agreement?",
            "What measures are in place to enforce user responsibilities in the legal agreement?"
        ],
        "use_gpt": true
    },
    {
        "intent": "intellectual_property_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "How does the legal agreement apply to intellectual property rights?",
            "Can you explain how the legal agreement applies to intellectual property?",
            "What are my rights regarding intellectual property under the legal agreement?",
            "Does the legal agreement address intellectual property rights?",
            "How is intellectual property addressed in the legal agreement?",
            "Are there any provisions in the legal agreement concerning intellectual property?",
            "How does the legal agreement protect my intellectual property?",
            "What rights do I retain for my intellectual property under the legal agreement?",
            "What are the restrictions on intellectual property outlined in the legal agreement?",
            "What are the terms regarding intellectual property rights in the legal agreement?"
        ],
        "responses": [
            "What are the terms, provisions, rights, protections, restrictions, and implications outlined in the legal agreement regarding intellectual property rights?"
        ],
        "test_questions": [
            "Does the legal agreement grant the company any rights over my intellectual property?",
            "What actions can the company take if there is a violation of intellectual property rights under the legal agreement?",
            "Are there any limitations on the use of third-party intellectual property in the legal agreement?",
            "How does the legal agreement define intellectual property?",
            "Are there any provisions for resolving disputes related to intellectual property in the legal agreement?",
            "Can you provide examples of intellectual property that are protected under the legal agreement?"
        ],
        "test_questions_advanced": [
            "Does the legal agreement grant the company any rights over my intellectual property?",
            "What actions can the company take if there is a violation of intellectual property rights under the legal agreement?",
            "Are there any limitations on the use of third-party intellectual property in the legal agreement?",
            "How does the legal agreement define intellectual property?",
            "Are there any provisions for resolving disputes related to intellectual property in the legal agreement?",
            "Can you provide examples of intellectual property that are protected under the legal agreement?"
        ],
        "use_gpt": true
    },
    {
        "intent": "use_restrictions_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "What are the restrictions on my use of the platform or service?",
            "What limitations are there on my use of the platform or service?",
            "Are there any restrictions or limitations on my use of the platform or service?",
            "What are the terms and conditions for using the platform or service?",
            "What are the rules for using the platform or service?",
            "What usage restrictions are specified in the legal agreement?",
            "What prohibitions or limitations apply to my use of the platform or service?",
            "What are the terms of use for the platform or service?",
            "What are the guidelines for using the platform or service?",
            "What are the terms and conditions for accessing and using the platform or service?"
        ],
        "responses": [
            "What are the terms, conditions, rules, restrictions, limitations, usage restrictions, prohibitions, and guidelines outlined in the legal agreement for using the platform or service?"
        ],
        "use_gpt": true
    },
    {
        "intent": "transfer_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "Can I transfer my account or subscription to someone else?",
            "Can I assign my account or subscription to someone else?",
            "Am I allowed to transfer ownership of my account or subscription to another individual?",
            "How can I transfer my account or subscription to a different person?",
            "What is the process for transferring my account or subscription to someone else?",
            "Is there a way to change the ownership of my account or subscription to someone else's name?",
            "Can I give my account or subscription to another person as a gift?",
            "What are the requirements for transferring my account or subscription to another individual?",
            "Is it permissible to sell my account or subscription to someone else?",
            "Can I pass on my account or subscription to a family member or friend?"
        ],
        "responses": [
            "What is the policy, process, requirements, and permissibility of transferring ownership or assigning an account or subscription to another individual?"
        ],
        "use_gpt": true
    },
    {
        "intent": "cancellation_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "What is the cancellation policy for subscriptions or services?",
            "How can I cancel my subscription?",
            "What is the process for cancelling a service?",
            "Can I get a refund if I cancel my subscription?",
            "Is there a fee for cancelling a subscription?",
            "What happens to my subscription if I cancel before it ends?",
            "Are there any restrictions on cancelling a subscription or service?",
            "When will my subscription be cancelled if I request it?",
            "What information do I need to provide when cancelling my subscription?",
            "Can I cancel my subscription at any time?"
        ],
        "responses": [
            "What is the cancellation policy, process, refund eligibility, fees (if any), restrictions, timing, and required information when cancelling a subscription or service?"
        ],
        "use_gpt": true
    },
    {
        "intent": "warranty_disclaimers_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "Are there any warranty disclaimers in the legal agreement?",
            "Does the legal agreement contain any disclaimers of warranties?",
            "Are there any warranty exemptions specified in the legal agreement?",
            "Are warranties disclaimed in the legal agreement?",
            "Does the legal agreement have any provisions that limit the warranties provided?",
            "Are there any warranty limitations in the legal agreement?",
            "What is the warranty disclaimer policy in the legal agreement?",
            "Are there any warranties that are not provided in the legal agreement?",
            "Does the legal agreement include a warranty disclaimer clause?",
            "Are there any warranties that are expressly disclaimed in the legal agreement?"
        ],
        "responses": [
            "What are the provisions, clauses, policy, limitations, exemptions, and disclaimers related to warranties specified in the legal agreement?"
        ],
        "use_gpt": true
    },
    {
        "intent": "limitations_of_liability_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "What are the limitations of liability in the legal agreement?",
            "What is the extent of liability limitations in the legal agreement?",
            "How does the legal agreement limit liability?",
            "Are there any liability restrictions outlined in the legal agreement?",
            "What liabilities are excluded or limited in the legal agreement?",
            "What types of liability are exempted in the legal agreement?",
            "Can you explain the liability limitations in the legal agreement?",
            "What are the specific liability caps outlined in the legal agreement?",
            "How are liability limitations determined in the legal agreement?",
            "Is there a section in the legal agreement that covers limitations of liability?"
        ],
        "responses": [
            "What are the provisions, restrictions, exemptions, caps, and determination methods for liability limitations outlined in the legal agreement?"
        ],
        "use_gpt": true
    },
    {
        "intent": "third_party_content_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "How does the legal agreement apply to third-party content or services?",
            "What is the legal agreement's stance on third-party content or services?",
            "Does the legal agreement cover third-party content or services?",
            "How are third-party content or services addressed in the legal agreement?",
            "Are there any provisions in the legal agreement regarding third-party content or services?",
            "What are the legal implications of using third-party content or services under the legal agreement?",
            "Can you explain how the legal agreement applies to third-party content or services?",
            "What are the rules around using third-party content or services under the legal agreement?",
            "Is there any protection for users regarding third-party content or services under the legal agreement?",
            "What is the legal responsibility of users for third-party content or services under the legal agreement?"
        ],
        "responses": [
            "What are the provisions, rules, legal implications, protection, responsibilities, and regulations outlined in the legal agreement regarding the use of third-party content or services?"
        ],
        "use_gpt": true
    },
    {
        "intent": "refunds_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "What is the company's policy on refunds?",
            "What is the refund policy for this company?",
            "Can I get a refund on my purchase?",
            "How do I request a refund?",
            "What are the refund options available to me?",
            "Is there a time limit for requesting a refund?",
            "What is the process for obtaining a refund?",
            "Does the company offer full or partial refunds?",
            "Are there any fees associated with requesting a refund?",
            "What are the criteria for a refund to be issued?"
        ],
        "responses": [
            "What is the company's refund policy, including the process for requesting a refund, any conditions, available refund options, time limits, full or partial refund offerings, associated fees, and criteria for a refund to be issued?"
        ],
        "use_gpt": true
    },
    {
        "intent": "violations_legal_statement",
        "category": "legal_statement",
        "train_questions": [
            "What happens if I violate the legal agreement?",
            "What are the consequences of breaching the legal agreement?",
            "What are the penalties for violating the legal agreement?",
            "What actions will the company take if I violate the legal agreement?",
            "Is there a penalty for breaking the legal agreement?",
            "How does the company respond to legal agreement violations?",
            "What are the repercussions of not following the legal agreement?",
            "Can I be penalized for violating the legal agreement?",
            "What happens if I fail to comply with the legal agreement?",
            "How does the company enforce the legal agreement?",
            "Are there any sanctions for not abiding by the legal agreement?"
        ],
        "responses": [
            "What are the potential consequences, penalties, actions, responses, repercussions, and enforcement measures that the company may take if a user violates the legal agreement?"
        ],
        "use_gpt": true
    },
    {
        "intent": "location_password_change",
        "category": "platform_settings",
        "train_questions": [
            "Where can I change my account password?",
            "How can I modify my password?",
            "Is there a way to change my password?",
            "Can you tell me where to change my password?",
            "How do I update my account password?",
            "What is the process for changing my password?",
            "I would like to change my account password, where can I do that?",
            "Could you please guide me to the password modification section?",
            "What steps should I follow to change my account password?",
            "Is there a password update option available?"
        ],
        "responses": [
            "To change your password, go into your account settings and click on..."
        ],
        "use_gpt": false
    },
    {
        "intent": "reset_password_change",
        "category": "platform_settings",
        "train_questions": [
            "I forgot my password, how can I reset it?",
            "What should I do if I forget my password?",
            "How do I recover my account if I forgot my password?",
            "What are the steps to reset my forgotten password?",
            "I can't remember my password, how can I get a new one?",
            "Is there a way to retrieve my password if I forgot it?",
            "How to reset my password if I can't remember it?",
            "What is the process to recover a forgotten password?",
            "Can you help me reset my password?",
            "I need to update my password, how do I do that?",
            "How can I change my password for my account?",
            "What is the process for updating my password?",
            "What are the steps to update my password?",
            "How do I reset my account password?",
            "What is the procedure for changing my password?",
            "Can you guide me through changing my account password?",
            "How do I modify my password for my account?",
            "What is the method for updating my password?",
            "I want to change my account password, what is the process?",
            "What do I need to do to update my password for my account?",
            "How do I change my password?",
            "Is it possible for me to change my password?",
            "What's the procedure for resetting a lost password?"
        ],
        "responses": [
            "If you forgot your password, or just want to change your password, please go to profile, then click on settings. Click on the change password and make sure to write a new one that is different from your last one"
        ],
        "use_gpt": false
    },
    {
        "intent": "problem_update_password_change",
        "category": "platform_settings",
        "train_questions": [
            "Why can't I change my password?",
            "What are the reasons I might not be able to change my password?",
            "What could be preventing me from changing my password?",
            "Is there a specific error message that appears when I try to change my password?",
            "Are there any restrictions on changing passwords?",
            "Is it possible that my account has been compromised and that's why I can't change my password?",
            "Do I need to meet certain criteria to change my password?",
            "Can you provide me with some troubleshooting steps if I can't change my password?",
            "What steps should I take if I'm having trouble changing my password?",
            "Is there a customer support team that can assist me with changing my password?",
            "Are there any known issues with changing passwords that I should be aware of?"
        ],
        "responses": [
            "If you are having trouble changing your password, please contact our customer support team at..."
        ],
        "use_gpt": false
    },
    {
        "intent": "visibility_publish_profile_status",
        "category": "My_visibility_settings",
        "train_questions": [
            "Can people see my profile?",
            "Can other users find my profile?",
            "Can other people find my profile?",
            "Can other users see my profile?",
            "Why can't other people see my profile?",
            "Why can't other people find my profile?",
            "Are other users able to see my profile?",
            "Are other people able to find my profile",
            "Are other people able to see my profile?",
            "Is my profile published?",
            "Is my profile visible to other users?",
            "Did I publish my profile?"
        ],
        "responses": [
            "Other people are currently able/unable to find your profile. To change it, go to the settings and please open the My visibility settings. After opening the My visibility settings, proceed to click on publish profile. If the background of the button is blue, it suggests that your profile is visible for other users. If it's grey, it suggests that your profile is not visible for other users. "
        ],
        "use_gpt": false
    },
    {
        "intent": "visibility_publish_profile_how_to",
        "category": "My_visibility_settings",
        "train_questions": [
            "How do I change my visibility?",
            "Where can I change my visibility settings?",
            "Can I change my visibility settings?",
            "Is it possible for me to change my visibility settings?",
            "Can I be visible for other users?"
        ],
        "responses": [
            "To change your visibility settings, please go to the settings and open the My visibility settings. After opening the My visibility settings, proceed to click on publish profile. If the background of the button is blue, it suggests that your profile is visible for other users. If it's grey, it suggests that your profile is not visible for other users. "
        ],
        "use_gpt": false
    },
    {
        "intent": "change_system_critical_notification_setting",
        "category": "system notifications",
        "platform_setting": "system critical notifications",
        "train_questions": [
            "How can I enable system critical notifications?",
            "Is there a way to receive system critical notifications?",
            "What steps do I need to take to set up system critical notifications?",
            "Where can I go to adjust the notification setting for system critical notifications?",
            "How do I change the platform setting to receive system critical notifications?",
            "Can I customize the notification options for system critical events?",
            "What is the process for modifying the platform setting related to receiving system critical notifications?",
            "Can you guide me through the steps to enable system critical notifications?",
            "Where can I find the option to change my preference for receiving system critical notifications?",
            "How do I enable or disable system critical notifications?"
        ],
        "responses": [
            "The platform's system critical notifications setting cannot be changed due to the importance of these notifications. Rest assured, system critical notifications, such as password resets and authentication emails, are sent properly to ensure the security and integrity of your account."
        ],
        "test_questions": [
            "Can I adjust the system critical notifications setting?",
            "Is it possible to customize system critical notifications?",
            "How do I set up system critical notifications?",
            "Where can I find the option to enable system critical notifications?",
            "Can you explain the importance of system critical notifications?"
        ],
        "test_questions_advanced": [
            "Can I adjust the system critical notifications setting?",
            "Is it possible to customize system critical notifications?",
            "How do I set up system critical notifications?",
            "Where can I find option to enable system critical notifications?",
            "Can you explain importance of system critical notifications?",
            "How to enable or disable system critical notifications?"
        ],
        "use_gpt": false
    },
    {
        "intent": "change_iYYU_news_notification_setting",
        "category": "system notifications",
        "platform_setting": "receive notifications about news shared by iYYU.com",
        "train_questions": [
            "How can I enable notifications for news shared by iYYU.com?",
            "Is there a way to receive notifications about news updates from iYYU.com?",
            "What steps do I need to take to set up notifications for news shared by iYYU.com?",
            "Where can I go to adjust the notification setting for news updates from iYYU.com?",
            "How do I change the platform setting to receive notifications about news shared by iYYU.com?",
            "Can I customize the notification options for news updates from iYYU.com?",
            "What is the process for modifying the platform setting related to receiving notifications about news shared by iYYU.com?",
            "Can you guide me through the steps to enable notifications for news updates from iYYU.com?",
            "Where can I find the option to change my preference for receiving notifications about news shared by iYYU.com?",
            "How do I enable or disable notifications for news updates from iYYU.com?"
        ],
        "responses": [
            "To receive notifications about news shared by iYYU.com, please follow these steps:\n1. Go to your 'Settings' or 'Preferences' within the platform.\n2. Look for the 'Notification Settings' or 'News Settings' option.\n3. Within the settings, locate the option related to receiving notifications for news updates from iYYU.com.\n4. Adjust the setting to your preferred choice, enabling or disabling the notification feature.\n5. Save the changes, and you will start receiving notifications about news shared by iYYU.com."
        ],
        "test_questions": [
            "How do I set up notifications for news updates from iYYU.com?",
            "Is there an option to receive notifications about news shared by iYYU.com?",
            "What are the steps to customize notification settings for news updates from iYYU.com?",
            "Where can I find the setting to control notifications for news updates from iYYU.com?",
            "Can you explain how to enable or disable notifications for news updates?"
        ],
        "test_questions_advanced": [
            "How do I set up notificatons for news updates from iYYU.com?",
            "Is there an option to receive notifications about news shared by iYYU.com?",
            "What are steps to customize notification settings for news updates from iYYU.com?",
            "Where can I find setting to control notifications for news updates from iYYU.com?",
            "Can you explain how to enable or disable notifications for news updates?",
            "Where can I find option to change my preference for receiving notifications about news shared by iYYU.com?"
        ],
        "use_gpt": false
    },
    {
        "intent": "change_update_notification_setting",
        "category": "system notifications",
        "platform_setting": "receive notifications when updates are released",
        "train_questions": [
            "How can I enable notifications for when updates are released?",
            "Is there a way to receive notifications when new updates are available?",
            "What steps do I need to take to set up notifications for released updates?",
            "Where can I go to adjust the notification setting for update releases?",
            "How do I change the platform setting to receive notifications when updates are released?",
            "Can I customize the notification options for update releases?",
            "What is the process for modifying the platform setting related to receiving notifications for updates?",
            "Can you guide me through the steps to enable notifications for update releases?",
            "Where can I find the option to change my preference for receiving notifications when updates are released?",
            "How do I enable or disable notifications for new updates?"
        ],
        "responses": [
            "To enable notifications for when updates are released, please follow these steps:\n1. Go to your 'Settings' or 'Preferences' within the platform.\n2. Look for the 'Notification Settings' or 'Update Settings' option.\n3. Within the settings, locate the option related to receiving notifications for update releases.\n4. Adjust the setting to your preferred choice, enabling or disabling the notification feature.\n5. Save the changes, and you will start receiving notifications when updates are released."
        ],
        "test_questions": [
            "How do I set up notifications for released updates?",
            "Is there an option to receive notifications when new updates are available?",
            "What are the steps to customize notification settings for update releases?",
            "Where can I find the setting to control notifications for update releases?",
            "Can you explain how to enable or disable notifications for updates?"
        ],
        "test_questions_advanced": [
            "How do I set up notificatons for released updates?",
            "Is there an option to receive notifications when new updates are available?",
            "What are steps to customize notification settings for update releases?",
            "Where can I find setting to control notifications for update releases?",
            "Can you explain how to enable or disable notifications for updates?",
            "Where can I find option to change my preference for receiving notifications when updates are released?"
        ],
        "use_gpt": false
    },
    {
        "intent": "change_note_follower_notification_setting",
        "category": "connect",
        "platform_setting": "receive a notification when someone starts following your notes",
        "train_questions": [
            "How can I enable notifications for when someone starts following my notes?",
            "Is there a way to receive notifications when someone begins following my notes?",
            "What steps do I need to take to set up notifications for followers of my notes?",
            "Where can I go to adjust the notification setting for note followers?",
            "How do I change the platform setting to receive notifications when someone starts following my notes?",
            "Can I customize the notification options for note followers?",
            "What is the process for modifying the platform setting related to receiving notifications for note followers?",
            "Can you guide me through the steps to enable notifications for note followers?",
            "Where can I find the option to change my preference for receiving notifications when someone starts following my notes?",
            "How do I enable or disable notifications for followers of my notes?"
        ],
        "responses": [
            "To enable notifications for when someone starts following your notes, please follow these steps:\n1. Go to your 'Settings' or 'Preferences' within the platform.\n2. Look for the 'Notification Settings' or 'Note Settings' option.\n3. Within the settings, locate the option related to receiving notifications for note followers.\n4. Adjust the setting to your preferred choice, enabling or disabling the notification feature.\n5. Save the changes, and you will start receiving notifications when someone starts following your notes."
        ],
        "test_questions": [
            "How do I set up notifications for followers of my notes?",
            "Is there an option to receive notifications when someone begins following my notes?",
            "What are the steps to customize notification settings for note followers?",
            "Where can I find the setting to control notifications for note followers?",
            "Can you explain how to enable or disable notifications for note followers?"
        ],
        "test_questions_advanced": [
            "How do I set up notificatons for followers of my notes?",
            "Is there an option to receive notifications when someone begins following my notes?",
            "What are steps to customize notification settings for note followers?",
            "Where can I find setting to control notifications for note followers?",
            "Can you explain how to enable or disable notifications for note followers?",
            "Where can I find option to change my preference for receiving notifications when someone starts following my notes?"
        ],
        "use_gpt": false
    },
    {
        "intent": "change_connection_response_notification_setting",
        "category": "connect",
        "platform_setting": "receive a notification when someone accepts or declines your request to connect",
        "train_questions": [
            "How can I enable notifications for when someone accepts or declines my connection request?",
            "Is there a way to receive notifications when someone responds to my connection request?",
            "What steps do I need to take to set up notifications for accepted or declined connection requests from other users?",
            "Where can I go to adjust the notification setting for incoming connection responses?",
            "How do I change the platform setting to receive notifications when someone accepts or declines my request to connect?",
            "Can I customize the notification options for incoming connection responses?",
            "What is the process for modifying the platform setting related to receiving notifications for accepted or declined connection requests?",
            "Can you guide me through the steps to enable notifications for connection responses?",
            "Where can I find the option to change my preference for receiving notifications when someone accepts or declines my connection request?",
            "How do I enable or disable notifications for incoming connection responses?"
        ],
        "responses": [
            "To enable notifications for when someone accepts or declines your connection request, please follow these steps:\n1. Go to your 'Settings' or 'Preferences' within the platform.\n2. Look for the 'Notification Settings' or 'Connection Settings' option.\n3. Within the settings, locate the option related to receiving notifications for connection responses.\n4. Adjust the setting to your preferred choice, enabling or disabling the notification feature.\n5. Save the changes, and you will start receiving notifications for incoming connection responses."
        ],
        "test_questions": [
            "How do I set up notifications for connection responses to my requests?",
            "Is there an option to receive notifications when someone responds to my connection request?",
            "What are the steps to customize notification settings for accepted or declined connection requests?",
            "Where can I find the setting to control notifications for incoming connection responses?",
            "Can you explain how to enable or disable notifications for connection responses?"
        ],
        "test_questions_advanced": [
            "How do I set up notificatons for connection responses to my requests?",
            "Is there an option to receive notifications when someone responds to my connection request?",
            "What are steps to customize notification settings for accepted or declined connection requests?",
            "Where can I find setting to control notifications for incoming connection responses?",
            "Can you explain how to enable or disable notifications for connection responses?",
            "Where can I find option to change my preference for receiving notifications when someone accepts or declines my connection request?"
        ],
        "use_gpt": false
    },
    {
        "intent": "change_connection_request_notification_setting",
        "category": "connect",
        "platform_setting": "receive a notification when someone wants to connect with you",
        "train_questions": [
            "How can I enable notifications for when someone wants to connect with me?",
            "Is there a way to receive notifications when someone sends me a connection request?",
            "What steps do I need to take to set up notifications for connection requests from other users?",
            "Where can I go to adjust the notification setting for incoming connection requests?",
            "How do I change the platform setting to receive notifications when someone wants to connect with me?",
            "Can I customize the notification options for incoming connection requests?",
            "What is the process for modifying the platform setting related to receiving notifications for connection requests?",
            "Can you guide me through the steps to enable notifications for connection requests?",
            "Where can I find the option to change my preference for receiving notifications when someone wants to connect with me?",
            "How do I enable or disable notifications for incoming connection requests?"
        ],
        "responses": [
            "To enable notifications for when someone wants to connect with you, please follow these steps:\n1. Go to your 'Settings' or 'Preferences' within the platform.\n2. Look for the 'Notification Settings' or 'Connection Settings' option.\n3. Within the settings, locate the option related to receiving notifications for connection requests.\n4. Adjust the setting to your preferred choice, enabling or disabling the notification feature.\n5. Save the changes, and you will start receiving notifications for incoming connection requests."
        ],
        "test_questions": [
            "How do I set up notifications for connection requests from other users?",
            "Is there an option to receive notifications when someone sends me a connection request?",
            "What are the steps to customize notification settings for incoming connection requests?",
            "Where can I find the setting to control notifications for incoming connection requests?",
            "Can you explain how to enable or disable notifications for connection requests?"
        ],
        "test_questions_advanced": [
            "How do I set up notificatons for connection requests from other users?",
            "Is there an option to receive notifications when someone sends me connection request?",
            "What are steps to customize notification settings for incoming connection requests?",
            "Where can I find setting to control notifications for incoming connection requests?",
            "Can you explain how to enable or disable notifications for connection requests?",
            "Where can I find option to change my preference for receiving notifications when someone wants to connect with me?"
        ],
        "use_gpt": false
    },
    {
        "intent": "change_followed_user_note_notification_setting",
        "category": "interact",
        "platform_setting": "receive notification when someone you follow publishes a note",
        "train_questions": [
            "How can I enable notifications for when someone I follow publishes a note?",
            "Is there a way to receive notifications when someone I'm following posts a note?",
            "What steps do I need to take to set up notifications for published notes from users I follow?",
            "Where can I go to adjust the notification setting for notes published by people I follow?",
            "How do I change the platform setting to receive notifications when someone I follow publishes a note?",
            "Can I customize the notification options for notes posted by users I follow?",
            "What is the process for modifying the platform setting related to receiving notifications for published notes from followed users?",
            "Can you guide me through the steps to enable notifications for notes published by the people I follow?",
            "Where can I find the option to change my preference for receiving notifications when someone I follow publishes a note?",
            "How do I enable or disable notifications for published notes from the people I follow?"
        ],
        "responses": [
            "To enable notifications for when someone you follow publishes a note, please follow these steps:\n1. Go to your 'Settings' or 'Preferences' within the platform.\n2. Look for the 'Notification Settings' or 'Note Settings' option.\n3. Within the settings, locate the option related to receiving notifications for published notes from users you follow.\n4. Adjust the setting to your preferred choice, enabling or disabling the notification feature.\n5. Save the changes, and you will start receiving notifications for published notes from the people you follow."
        ],
        "test_questions": [
            "How do I set up notifications for notes published by users I follow?",
            "Is there an option to receive notifications when someone I follow posts a note?",
            "What are the steps to customize notification settings for published notes from followed users?",
            "Where can I find the setting to control notifications for notes published by people I follow?",
            "Can you explain how to enable or disable notifications for published notes from followed users?"
        ],
        "test_questions_advanced": [
            "How do I set up notificatons for notes published by users I follow?",
            "Is there an option to receive notifications when someone I follow posts note?",
            "What are steps to customize notification settings for published notes from followed users?",
            "Where can I find the setting to control notifications for notes published by people I follow?",
            "Can you explain how to enable or disable notifications for published notes from followed users?",
            "Where can I find option to change my preference for receiving notifications when someone I follow publishes note?"
        ],
        "use_gpt": false
    },
    {
        "intent": "change_message_notification_preference",
        "category": "interact",
        "platform_setting": "receive notification when someone sends you a message",
        "train_questions": [
            "How can I modify the setting to receive notifications when someone sends me a message?",
            "Is there a way to change the notification preference for incoming messages on this platform?",
            "What steps do I need to take to update my notification settings for incoming messages?",
            "Where can I go to adjust the setting that controls message notification alerts?",
            "How do I change the platform setting to receive notifications when someone sends me a message?",
            "Is it possible to customize the notification options for incoming messages?",
            "What is the process for modifying the platform setting related to receiving message notifications?",
            "Can you guide me through the steps to alter the setting for message notification alerts?",
            "Where can I find the option to change my preference for receiving notifications when I receive a message?",
            "How do I enable or disable the notification feature for incoming messages?"
        ],
        "responses": [
            "To change the setting for receiving notifications when someone sends you a message, please follow these steps:\n1. Go to the 'Settings' or 'Preferences' section of the platform.\n2. Look for the 'Notification Settings' or 'Message Settings' option.\n3. Within the settings, locate the option related to receiving notifications for incoming messages.\n4. Adjust the setting to your preferred choice, enabling or disabling the notification feature.\n5. Save the changes, and your notification preferences for incoming messages will be updated accordingly."
        ],
        "test_questions": [
            "How do I adjust the platform setting for receiving message notifications?",
            "Is there a way to modify the notification preference for messages on this platform?",
            "What are the steps to update my message notification settings?",
            "Where can I find the option to control message notification alerts?",
            "Can you explain how to enable or disable notifications for incoming messages?"
        ],
        "test_questions_advanced": [
            "How do I ajust the platform setting for reciving message notifications?",
            "Is there way to modify notification preference for messages on this platform?",
            "What are steps to update my message notification settings?",
            "Where can I find option to control message notification alerts?",
            "Can you explain how to enable or disable notificatons for incoming messages?",
            "Where I find option to change my preference for receiving message notifications?"
        ],
        "use_gpt": false
    },
    {
    "intent": "hello_response",
        "category": "generic",
        "train_questions": [
            "Hello!",
            "Hi there!",
            "Hey!",
            "Good morning!",
            "Good afternoon!",
            "Good evening!"
        ],
        "responses": [
            "Hello! How can I assist you today?"
        ],
        "test_questions": [
            "What's up",
            "hey, I have a question",
            "What's up",
            "I have a question"
        ],
        "test_questions_advanced": [
            "What's up",
            "hey, I have a question",
            "What's up",
            "I have a question"
        ],
        "use_gpt": false
    },
    {
        "intent": "thanks_response",
        "category": "generic",
        "train_questions": [
            "Thank you!",
            "Thanks a lot!",
            "Appreciate it!",
            "I'm grateful!",
            "Many thanks!",
            "Thank you so much!",
            "Thank you very much!",
            "My thanks"
        ],
        "responses": [
            "You're welcome! How can I assist you further?"
        ],
        "test_questions": [
            "thanks but",
            "I understand now",
            "thanks",
            "I appreciate it",
            "Thank you for the information"
        ],
        "test_questions_advanced": [
            "thanks but",
            "I understand now",
            "thanks",
            "I appreciate it",
            "Thank you for the information"
        ],
        "use_gpt": false
    }
]