[
    {
        "intent": "summarization_privacy",
        "category": "privacy_policy",
        "text": [
            "Could you provide a summary of your privacy policy?",
            "What are the key points of your privacy policy?",
            "In a few sentences, what does your privacy policy say?",
            "Can you give me an overview of your privacy policy?",
            "What is your privacy policy about?",
            "Can you give me a brief explanation of your privacy policy?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "opt_out",
        "category": "privacy_policy",
        "text": [
            "How do I opt out of data sharing?",
            "Is there a way to opt out of sharing my data?",
            "What are my options for opting out of data sharing?",
            "Can you explain how to opt out of data sharing?",
            "How can I prevent my data from being shared?",
            "Can I choose not to have my data shared?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "third_parties",
        "category": "privacy_policy",
        "text": [
            "Do you share my personal information with third parties?",
            "Who do you share my personal information with?",
            "Are there any third parties that have access to my personal information?",
            "What third parties have access to my personal information?",
            "What happens to my personal information after it is shared with a third party?",
            "How is my personal information protected when it is shared with third parties?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "data_collection",
        "category": "privacy_policy",
        "text": [
            "What kind of information does your privacy policy collect?",
            "What data do you collect through your privacy policy?",
            "What personal information is collected by your privacy policy?",
            "What types of data does your privacy policy ask for?",
            "What kind of user data does your privacy policy require?",
            "What are the data collection policies in your privacy policy?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "personal_information",
        "category": "privacy_policy",
        "text": [
            "How does the company use my personal information?",
            "What does the company do with my personal information?",
            "In what ways is my personal information used by the company?",
            "What is the company's policy on using my personal information?",
            "What kind of personal information does the company collect from me?",
            "Can I choose how my personal information is used by the company?",
            "Is my personal information used for any other purposes besides what I agreed to?",
            "How long does the company retain my personal information?",
            "Who within the company has access to my personal information?",
            "What happens to my personal information if I stop using the company's services?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "personal_information_third_parties",
        "category": "privacy_policy",
        "text": [
            "Is my personal information shared with third parties?",
            "Does the company share my personal information with anyone else?",
            "Who else has access to my personal information?",
            "How is my personal information protected when it is shared with third parties?",
            "What kind of third parties does the company share my personal information with?",
            "Do I have any control over who the company shares my personal information with?",
            "Is my personal information sold to third parties?",
            "How does the company ensure that third parties protect my personal information?",
            "What happens to my personal information if a third party is acquired by or merges with the company?",
            "Can I opt-out of having my personal information shared with third parties?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "data_storage",
        "category": "privacy_policy",
        "text": [
            "How is my personal information stored and secured?",
            "What measures does the company take to protect my personal information?",
            "What kind of security protocols are in place for my personal information?",
            "Who has access to my personal information?",
            "How is my personal information encrypted?",
            "Where is my personal information stored?",
            "What happens to my personal information if there is a security breach?",
            "How often is my personal information backed up?",
            "How long is my personal information retained for?",
            "Can I request that my personal information be deleted?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "personal_information_rights",
        "category": "privacy_policy",
        "text": [
            "What are my rights regarding my personal information?",
            "Can I access my personal information?",
            "Can I update or correct my personal information?",
            "Can I delete my personal information?",
            "What happens to my personal information if I delete my account?",
            "Can I request a copy of my personal information?",
            "How long does it take for the company to respond to my personal information requests?",
            "What information does the company need from me to process my personal information requests?",
            "Can I object to the company processing my personal information?",
            "What can I do if the company violates my personal information rights?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "access_personal_data",
        "category": "privacy_policy",
        "text": [
            "How can I request access to my personal information?",
            "What is the process for requesting access to my personal information?",
            "How do I go about requesting access to my personal information?",
            "How can I access my personal information?",
            "Can you tell me how to request access to my personal information?",
            "What steps should I take to request access to my personal data?",
            "How do I obtain access to my personal information?",
            "What is the procedure to request access to my personal information?",
            "Can you guide me on how to access my personal information?",
            "What do I need to do to gain access to my personal information?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "update_personal_data",
        "category": "privacy_policy",
        "text": [
            "How can I update my personal information?",
            "What is the process to update my personal information?",
            "How do I go about updating my personal information?",
            "Can you tell me how to update my personal information?",
            "What steps should I take to update my personal data?",
            "How do I make changes to my personal information?",
            "What is the procedure to update my personal information?",
            "Can you guide me on how to update my personal information?",
            "What do I need to do to modify my personal information?",
            "How can I make changes to my personal information?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "delete_personal_information",
        "category": "privacy_policy",
        "text": [
            "How can I delete my personal information?",
            "What is the process to delete my personal information?",
            "How do I go about deleting my personal information?",
            "Can you tell me how to delete my personal information?",
            "What steps should I take to delete my personal data?",
            "How do I remove my personal information?",
            "What is the procedure to delete my personal information?",
            "Can you guide me on how to delete my personal information?",
            "What do I need to do to erase my personal information?",
            "How can I request the removal of my personal information?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "cookie_policy",
        "category": "privacy_policy",
        "text": [
            "What are the company's cookie policies?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "privacy_regulations",
        "category": "privacy_policy",
        "text": [
            "Does the company comply with privacy regulations?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "privacy_policy_updates",
        "category": "privacy_policy",
        "text": [
            "How often is the privacy policy updated?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "minimum_age",
        "category": "privacy_policy",
        "text": [
            "What is the minimum age requirement for using the company's services?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "data_breaches",
        "category": "privacy_policy",
        "text": [
            "How does the company handle data breaches?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "opt_out_targeted_advertising",
        "category": "privacy_policy",
        "text": [
            "Can I opt-out of targeted advertising?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "contact_privacy_concerns",
        "category": "privacy_policy",
        "text": [
            "How can I contact the company for privacy-related concerns?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "disagree_privacy_consequences",
        "category": "privacy_policy",
        "text": [
            "What are the consequences of not agreeing to the privacy policy?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "selling_personal_data",
        "category": "privacy_policy",
        "text": [
            "Does the company sell my personal information?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "personal_data_account_deletion",
        "category": "privacy_policy",
        "text": [
            "What happens to my personal information when I terminate my account?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "question_answering",
        "category": "legal_statement",
        "text": [
            "What are the terms of service for this platform?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "summarization_legal_statement",
        "category": "legal_statement",
        "text": [
            "Can you summarize the liability section of the terms of service?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "terms_of_service_legal_statement",
        "category": "legal_statement",
        "text": [
            "What are the terms of service for this platform?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "governing_law_legal_statement",
        "category": "legal_statement",
        "text": [
            "What is the governing law for the legal agreement?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "liability_legal_statement",
        "category": "legal_statement",
        "text": [
            "Can you summarize the liability section of the legal agreement?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "dispute_resolution_legal_statement",
        "category": "legal_statement",
        "text": [
            "What is the dispute resolution process outlined in the legal agreement?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "arbitration_legal_statement",
        "category": "legal_statement",
        "text": [
            "Can I opt-out of arbitration?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "small_claims_court_legal_statement",
        "category": "legal_statement",
        "text": [
            "How are disputes handled in small claims court?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "user_obligations_legal_statement",
        "category": "legal_statement",
        "text": [
            "What are my obligations as a user under the legal agreement?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "intellectual_property_legal_statement",
        "category": "legal_statement",
        "text": [
            "How does the legal agreement apply to intellectual property rights?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "use_restrictions_legal_statement",
        "category": "legal_statement",
        "text": [
            "What are the restrictions on my use of the platform or service?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "transfer_legal_statement",
        "category": "legal_statement",
        "text": [
            "Can I transfer my account or subscription to someone else?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "cancellation_legal_statement",
        "category": "legal_statement",
        "text": [
            "What is the cancellation policy for subscriptions or services?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "warranty_disclaimers_legal_statement",
        "category": "legal_statement",
        "text": [
            "Are there any warranty disclaimers in the legal agreement?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "limitations_of_liability_legal_statement",
        "category": "legal_statement",
        "text": [
            "What are the limitations of liability in the legal agreement?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "third_party_content_legal_statement",
        "category": "legal_statement",
        "text": [
            "How does the legal agreement apply to third-party content or services?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "refunds_legal_statement",
        "category": "legal_statement",
        "text": [
            "What is the company's policy on refunds?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "violations_legal_statement",
        "category": "legal_statement",
        "text": [
            "What happens if I violate the legal agreement?"
        ],
        "responses": [],
        "use_gpt": true
    },
    {
        "intent": "location_password_change",
        "category": "platform_settings",
        "text": [
            "Where can I change my account password?",
            "Where can i change my password?"
        ],
        "responses": [],
        "use_gpt": false
    },
    {
        "intent": "reset_password_change",
        "category": "platform_settings",
        "text": [
            "I forgot my password, what do I do?",
            "Is it possible to change my password?",
            "I'd like to change my password?"
        ],
        "responses": [
            "It is possible to change your password. You can go to the settings and click on...  "
        ],
        "use_gpt": false
    },
    {
        "intent": "update_password_change",
        "category": "platform_settings",
        "text": [
            "I need to update my password, how do I do that?",
            "How do I change my password",
            "How to change password",
            "How do I reset my password?",
            "Can you help me change my password?"
        ],
        "responses": [],
        "use_gpt": false
    },
    {
        "intent": "problem_update_password_change",
        "category": "platform_settings",
        "text": [
            "Why can't I change my password?"
        ],
        "responses": [],
        "use_gpt": false
    }
]